#Область СлужебныеПроцедурыИФункции

Функция ПолучитьНастройкиОбмена() экспорт
	
	НастройкиОбмена = Новый Соответствие();
	
	НастройкиВыборка = РегистрыСведений.ОбменМП_НастройкиРасширения.Выбрать();
	Пока НастройкиВыборка.Следующий() цикл
		НастройкиОбмена.Вставить(НастройкиВыборка.ВидНастройки, НастройкиВыборка.Значение);		
	КонецЦикла;
	
	Возврат НастройкиОбмена;
		
КонецФункции

Процедура ЗаписатьНастройкиОбмена(ВидНастройки, ЗначениеНастройки) экспорт
	
	НаборНастроек = РегистрыСведений.ОбменМП_НастройкиРасширения.СоздатьНаборЗаписей();
	НаборНастроек.Отбор.ВидНастройки.Установить(ЗначениеНастройки);
	НаборНастроек.Прочитать();
	Если НаборНастроек.Количество() = 0 тогда
		НоваяНастройка = НаборНастроек.Добавить();
		НоваяНастройка.ВидНастройки = ВидНастройки;
		НоваяНастройка.Значение = ЗначениеНастройки;
	Иначе
		Для каждого Запись из НаборНастроек цикл
			Запись.Значение = ЗначениеНастройки;
		КонецЦикла;
	КонецЕсли;
	
	НаборНастроек.Записать(Истина);
		
КонецПроцедуры

Функция ПолучитьРазрешенныеЗдания(МассивУникальныхИдентификаторов, Параметры) экспорт
	
	//Преобрзование массива в таблицу для соединения в запросе
	ТаблицаУникальныхИдентификаторов = Новый ТаблицаЗначений();
	ТаблицаУникальныхИдентификаторов.Колонки.Добавить("УникальныйИдентификатор", Новый ОписаниеТипов("УникальныйИдентификатор"));
	Для каждого ИдентификаторИзМассива из МассивУникальныхИдентификаторов цикл
		НоваяСтрока =ТаблицаУникальныхИдентификаторов.Добавить();
		НоваяСтрока.УникальныйИдентификатор = ИдентификаторИзМассива;		
	КонецЦикла;
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТаблицаУникальныхИдентификаторов.УникальныйИдентификатор
	|ПОМЕСТИТЬ СписокУникальныхИдентификаторов
	|ИЗ
	|	&ТаблицаУникальныхИдентификаторов КАК ТаблицаУникальныхИдентификаторов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбменМП_МесяцыНачисленийУникальныеИдентификаторы.УникальныйИдентификатор,
	|	ОбменМП_МесяцыНачисленийУникальныеИдентификаторы.Ссылка.МесяцНачислений
	|ИЗ
	|	СписокУникальныхИдентификаторов КАК СписокУникальныхИдентификаторов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОбменМП_МесяцыНачислений.УникальныеИдентификаторы КАК
	|			ОбменМП_МесяцыНачисленийУникальныеИдентификаторы
	|		ПО ОбменМП_МесяцыНачисленийУникальныеИдентификаторы.УникальныйИдентификатор = СписокУникальныхИдентификаторов.УникальныйИдентификатор";
	
	Запрос.УстановитьПараметр("НачалоПериода", Параметры.НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Параметры.КонецПериода));
	Запрос.УстановитьПараметр("ТаблицаУникальныхИдентификаторов", ТаблицаУникальныхИдентификаторов);	
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаЗапрос = РезультатЗапроса.Выбрать();
	
	Возврат ВыборкаЗапрос;
		
КонецФункции

#КонецОбласти